{"TITLE":"Schritt4: Frameworks &amp; Co.","CONTENT":"Das Bootstrap-Framework\r\n=======================\r\n\r\nProgrammiersprachen sind das eine, doch mit entsprechenden [Frameworks](https:\/\/de.wikipedia.org\/wiki\/Framework) steigen die Möglichkeiten i.d.R. nochmals erheblich bei idealerweise reduzierter Komplexität und Aufwand sowie einer einigermaßen einheitlichen Programmstruktur.\r\n\r\nBei Bootstrap handelt es sich um ein Framework für responsive Webseiten auf Basis von HTML5, CSS, und Java-Skript (zumeist in Form von JQuerry).\r\nBootstrap startete als internes Tool bei Twitter, wurde aber mitlerweile unter freier Lizenz freigegeben. Ziel war es Nutzer ohne größeres Gestaltungsgeschick zu befähigen, brauchbar gestaltete und vom OS, Client und Gerät des Nutzers unabhängige Webseiten zu erstellen.\r\nDas Framework setzt auf progressive Verbesserung (das wichtigste sollte immer funktionieren, Kosmetik jedoch nur nach Verfügbarkeit). Neben Less-Stylesheets <lesscss.org> (die zu CSS kompiliert werden, eine Obermenge der CSS-Funktionen abdecken, und sehr anpassbar sein sollen) wird alternativ noch Sass unterstützt. Die hierfür nötigen Komponenten (soweit ich es sehe alle unter freier Lizenz) können lokal installiert oder von einer anderen Installation (etwa Google) referenziert werden. Wiederverwendbarkweit soll bei Komponenten eine große Rolle spielen. Zusaätzlich gibts auch noch (Java-Skript-)Plugins (basierend auf JQuerry).\r\n\r\nBootstrap im Netz:\r\n* http:\/\/getbootstrap.com\/\r\n* http:\/\/holdirbootstrap.de\/\r\n* https:\/\/github.com\/twbs\/bootstrap\/\r\n\r\nWeitere Doku und im Browser durcharbeitbare Tutorials gibts unter:\r\n* http:\/\/www.w3schools.com\/bootstrap\/","ID":"2016_06_12-12_14_29","COMMENTS":[{"CDATE":"2016-06-12 15:15","CNAME":"Norman","CEMAIL":"keine-em@il.de","CCONTENT":"Für diese Belegarbeit haben wir uns zudem eine eigene Bootstrap-Instanz für diesen Blog aufgesetzt."}],"DATE":"2016-06-12 12:14"}